const ip = "";

// 正则
// .*?\(\(byte\)(\d)\)[,;].*?//(\S.*)
// \t"$1": "$2",

// 性别
const Gender = {
    "1": "男",
    "0": "女",
    "2": ""
};

const TransactionType = {
    "1": "投资",
    "2": "充值",
    "3": "提现",
    "4": "还款",
};

const CompanyAuditStatus = {
    "-1": "审核失败",
    "1": "待审核",
    "2": "审核通过",
};

// 标状态
const IfbStatus = {
    "0": "后台添加",
	"1": "已在app显示",
	"2": "满标",
	"3": "到约定还款日期",
	"4": "已还款到平台",
	"5": "已经还款给个人",
	"8": "审核通过",
	"9": "审核不通过",
    "10": ""
};

// 标类型
const IfbType = {
	"1": "新手标",
	"2": "推荐标",
	"3": "普通标"
};

// 标还款方式
const ReturnMethod = {
	"1": "到期一次性还本付息",
};
